docs: refactor budgets
